import time

# შეკითხვები მომხმარებლისთვის
flashcards = {
    "ვინ დაწერა 'ვეფხისტყაოსანი'?":"შოთა რუსთაველმა",
    "რა არის ირლანდიის დედაქალაქი?":"დუბლინი",
    "რომელია ყველაზე პატარა მარტივი რიცხვი?":"2",
    "რომელი პლანეტაა მზის სისტემაში ყველაზე დიდი?":"იუპიტერი",
    "რა არის მსოფლიოში ყველაზე დიდი ოკეანე?": "წყნარი ოკეანე",
    "რომელია მსოფლიოს ყველაზე მაღალი მთა?": "ევერესტი",
    " რა არის ცოფიანი ძაღლის დაავადება?": "რაბი",
    "როგორი სახეობა არის გორილა?": "მტაცებელი",
    " ვინ აღმოაჩინა ამერიკა?": "ქრისტეფორე კოლუმბი",
    "რომელია ყველა ელემენტის ყველაზე მსუბუქი ატომი?": "წყალბადის (H)",
    " ვინ იყო მარლი და მე წიგნის ავტორი?": "ჯონ გრინ",
    "რა არის ქიმიური ფორმულა წყლისთვის?": "H₂O",
    "რა არის ჯოან როულინგის ყველაზე ცნობილი წიგნი?": "ჰარი პოტერი და ფილოსოფიური ქვა",
    "რომელია ლუდვიგ ვან ბეთოვენის ყველაზე ცნობილი სიმფონია?": "მეხუთე სიმფონია"
}

# მომხმარებელს თვითონ შეუძლია შეიყვანოს მისთვის სასურველი დროის ლიმიტი წამებში
my_time = int(input("შეიყვანეთ თქვენთვის სასურველი დრო: "))

for question, answer in flashcards.items():
    print(question)
    start_time = time.time() #დაწყების დრო
    user_answer = input(f"შენ გაქვს {my_time} წამი საპასუხოდ: ")

# საკმარისია თუ არა მოცემული დრო მომხმარებლისთვის
    if time.time() - start_time > my_time:
        print("დრო ამოიწურა!", answer)
    else:
        # პასუხის შესამოწმებლად
        if user_answer.lower() == answer.lower(): # სწორი პასუხის შემთხვევაში 
            print("სწორია! ყოჩაღ!")
        else: # არასწორი პასუხის შემთხვევაში
            print(f"არასწორია! სწორი პასუხია: {answer}")